app/views/carts/templates/_cart_discount_container.html.slim

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 4]]
---
    .discount-container__header--left
      p.mb-4= "#{cart.line_items.sum(&:quantity)} #{word_form(cart.line_items.sum(&:quantity))} на сумму"