app/views/carts/show.html.slim

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 3]]
---
  .line-item-container
    -if @cart.line_items.present?
      .line-item-content.mb-32