app/controllers/application_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "discount") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2024-08-22 14:15:00.264239"], ["updated_at", "2024-08-22 14:15:00.264239"], ["discount", "0.0"]]
---
  def current_cart
    if session[:cart_id]
      @current_cart = Cart.find_by(id: session[:cart_id])
      if @current_cart.nil?
        session[:cart_id] = nil
        @current_cart = Cart.create
        session[:cart_id] = @current_cart.id
      end
    else
      @current_cart = Cart.create