app/controllers/carts_controller.rb

  def destroy
    @cart = @current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]

  def update_discount
    @cart = @current_cart
    @cart.update(discount: params['discount'])
---
UPDATE "carts" SET "updated_at" = $1, "discount" = $2 WHERE "carts"."id" = $3  [["updated_at", "2024-08-22 14:21:04.376814"], ["discount", "64.0"], ["id", 4]]