app/controllers/line_items_controller.rb

  def create
    product = Product.find_by(id: params[:product_id])
    if product
      @line_item = @current_cart.add_product(product.id)

      respond_to do |format|
        if @line_item.save
          @cart_counter = @current_cart.line_items.sum(&:quantity)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "line_items" ("quantity", "product_id", "cart_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["quantity", 1], ["product_id", 1], ["cart_id", 1], ["order_id", nil], ["created_at", "2024-08-22 10:33:43.660402"], ["updated_at", "2024-08-22 10:33:43.660402"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 11], ["updated_at", "2024-08-22 11:42:33.120951"], ["id", 4]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy

    if @current_cart.line_items.count != 0
      respond_to do |format|
        @cart_counter = @current_cart.line_items.sum(&:quantity)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 3]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 8]]

  def update
    @line_item = LineItem.find(params[:id])
    quantity = params[:line_item][:quantity].to_i

    if quantity.present?
      @line_item.update(quantity: quantity)

      respond_to do |format|
        if @line_item.save
          @cart_counter = @current_cart.line_items.sum(&:quantity)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2024-08-22 15:31:17.461908"], ["id", 35]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 8]]