app/views/layouts/application.html.slim

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
---
              #cart-counter.counter class="#{@current_cart.line_items.sum(&:quantity) == 0 ? "hidden" : ""}"
                span = @current_cart.line_items.sum(&:quantity)